[
  {"type": "h2", "sectionID": "section1", "elementContent": ["Wymagania minimalne windows 10"]},

    {"type": "span", "sectionID": "section1","elementContent":["Poniżej przedstawiono minimalne wymagania do instalacji Windows 10. Pełna specyfikacja na stronie producenta: ",""]},
     {"type": "link","sectionID":"section1","elementContent":["https://www.microsoft.com/pl-pl/windows/windows-10-specifications"]},
  
    {"type": "table", "sectionID": "section1","elementContent":
      [
        ["Nazwa podzespołu","Wymagania dla wersji 32-bitowej","Wymagania dla wersji 64-bitowej"],
        ["Procesor CPU","1GHz lub lepszy"],
        ["Pamięć RAM","1GB","2GB"],
        ["Rozmiar dysku twardego","16GB","32GB"],
        ["Karta graficzna","Zgodna z DirectX 9"]
      ]
    },
{"type": "h2", "sectionID": "section2", "elementContent": ["Wersje windows 10"]},
    {"type": "span", "sectionID": "section2","elementContent":["Windows 10, podobnie jak każda poprzednia i kolejna edycja, jest podzielony na wersje zawierające lub nie dane funkcje systemu.",""]},
   
  {"type": "span", "sectionID": "section2","elementContent":["Wersje N systemów Windows są specjalnymi edycjami przeznaczonymi na rynek europejski UE, które nie zawierają odtwarzacza multimediów Windows Media Player oraz aplikacji Groove Music i Film i TV. Istnieją z kilku powodów:",""]},

{"type": "br", "sectionID": "section2"},
  
    {"type": "list","sectionID": "section2", "elementContent": {"ver":"ol",
    "listElements":[
      [
        {"type": "bi", "sectionID": "section2","elementContent":["Decyzje prawne:",""]},
        {"type": "span", "sectionID": "section2","elementContent":["Wersje ",""]},
        {"type": "i", "sectionID": "section2","elementContent":["N","red"]},
        {"type": "span", "sectionID": "section2","elementContent":["powstały w wyniku decyzji prawnych. W ",""]},
        {"type": "b", "sectionID": "section2","elementContent":["2004",""]},
        {"type": "span", "sectionID": "section2","elementContent":[" roku Komisja Europejska nakazała Microsoftowi dostarczenie wersji systemu Windows bez odtwarzacza Windows Media Player, aby zapewnić uczciwą konkurencję na rynku przeglądarek internetowych i odtwarzaczy multimedialnych.",""]}
      ],
      "Decyzje prawne: Wersje N powstały w wyniku decyzji prawnych. W 2004 roku Komisja Europejska nakazała Microsoftowi dostarczenie wersji systemu Windows bez odtwarzacza Windows Media Player, aby zapewnić uczciwą konkurencję na rynku przeglądarek internetowych i odtwarzaczy multimedialnych.",
    
      "Wybór użytkownika: Wersje N pozwalają użytkownikom wybrać, czy chcą korzystać z odtwarzacza Windows Media Player czy z innych dostępnych aplikacji multimedialnych. Dla niektórych użytkowników odtwarzacz Windows Media Player nie jest potrzebny, dlatego wersje N stanowią alternatywę.",
    
      "Specjalne zastosowania: Wersje N są również używane w niektórych specjalistycznych zastosowaniach, takich jak systemy wbudowane, urządzenia kioskowe czy komputery w miejscach publicznych. Wyeliminowanie odtwarzacza multimedialnego może pomóc w zminimalizowaniu zbędnych funkcji."
      ] }},

  {"type": "br", "sectionID": "section2"},

    {"type": "span", "sectionID": "section2","elementContent":["W skrócie, wersje ",""]},
    {"type": "b", "sectionID": "section2","elementContent":["N",""]},
    {"type": "span", "sectionID": "section2","elementContent":["to opcje dla użytkowników, którzy nie potrzebują odtwarzacza Windows Media Player lub preferują inne rozwiązania multimedialne np.: ",""]},
    {"type": "b", "sectionID": "section2","elementContent":["VLC Media Player",""]},
    {"type": "span", "sectionID": "section2","elementContent":[", który był mocno popularny na systemach z rodziny GNU Linux.",""]},

  
  {"type": "table", "sectionID": "section2","elementContent":
      [
        ["Edycja","Opis"],
        ["Windows 10 Home","Edycja dla użytkowników domowych. Oferuje podstawowe możliwości wystarczające dla odbiorcy nie wykorzystującego systemu w sposób zaawansowany."],
        ["Windows 10 Pro","Rozszerza funkcje Home o możliwości dla małych firm. Pozwala na zarządzanie urządzeniami w tym dołączenie do domeny Active Directory, ochronę danych poprzez szyfrowanie z pomocą BitLocker, obsługę pracy zdalnej i korzystanie z technologii chmurowych, oraz wykorzystanie oprogramowania do wirtualizacji - Hyper-V."],
        ["Windows 10 Pro for Workstations","Wersja dla zaawansowanego sprzętu, obsługująca obciążenia krytyczne i intensywne obliczenia. Oferuje unikalne wsparcie dla sprzętu serwerowego i jest zaprojektowana, aby sprostać wymaganiom związanym z pracą o kluczowym znaczeniu i obciążeniami obliczeniowymi."],
        ["Windows 10 Enterprise","Dostarcza wszystkie funkcje Windows 10 Pro for Workstations, a także dodatkowe możliwości dla organizacji opartych na technologii IT."],
        ["Windows 10 IoT Enterprise","Edycja dla urządzeń Internetu Rzeczy (IoT). Oferuje dostosowane funkcje dla specjalistycznych zastosowań, takich jak automatyka przemysłowa, urządzenia medyczne i inne."],
        ["Windows 10 Enterprise multi-session","Opcja dla wirtualnych desktopów wielosekcyjnych (multi-session) w środowiskach zdalnych. Pozwala na uruchamianie wielu sesji użytkownika na jednym serwerze. W normalnych warunkach z systemu może korzystać jeden użytkownik na raz i trzeba się pomiędzy nimi przełączać. W tej wersji system jest wstanie obsługiwać wielu użytkowników zdalnych w jednym momencie "],
        ["Windows 10 Pro Education","Podobna do Windows 10 Pro, ale dostosowana do środowisk edukacyjnych. Obejmuje opcje konfiguracji i wdrażania w szkołach. Umożliwia instalację oprogramowania tylko poprzez Microsoft Store. Daje możliwość wdrożenia użytkowników poprzez sieć Internat za pośrednictwem Azure konfiguruje i dostosowuje urządzenia do pracy w pseudo domenie szkolnej."]
      ]
    },
{"type": "h2", "sectionID": "section3", "elementContent": ["Przejdź do instalacji Windows 10"]},
    {"type": "span", "sectionID": "section3","elementContent":["Gdy wiesz jaką wersje windowsa chcesz to teraz potrzebujesz pliku ISO",""]},
 {"type": "link-art", "sectionID": "section3", "elementContent": ["Obrazy systemów Windows", "Typy i rozszerzenia plików"]},
   {"type": "br", "sectionID": "section3"},
  {"type": "span", "sectionID": "section3","elementContent":["Nie wiesz co to plik obrazu ISO? To sprawdź to:",""]},
 {"type": "link-art", "sectionID": "section3", "elementContent": ["Obrazy ISO - Co to jest", "Typy i rozszerzenia plików"]},
   {"type": "br", "sectionID": "section3"},
  {"type": "span", "sectionID": "section3","elementContent":["Gdy masz już plik ISO Windowsa możesz przejść do instalacji:",""]},
  {"type": "link-art", "sectionID": "section3", "elementContent": ["Instalacja Windows 10 w VirtualBox", "Windows 10"]}   
]
